#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws01/runs/run-P3TZzY8my1NeTpjE

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.ansible.aws_ecr_repository_policy.policy: Refreshing state... [id=ansible]
module.ansible.aws_iam_role.role: Refreshing state... [id=ansible_ECSTaskRole]
module.ansible.aws_ecr_lifecycle_policy.lifecycle: Refreshing state... [id=ansible]
module.ansible.aws_ecs_task_definition.task: Refreshing state... [id=ansible]
module.ansible.aws_ecr_repository.repository: Refreshing state... [id=ansible]
module.ansible.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:531133914787:cluster/ansible]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ansible.aws_ecr_lifecycle_policy.lifecycle has been deleted
  - resource "aws_ecr_lifecycle_policy" "lifecycle" {
      - id          = "ansible" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Expire untagged images after 1 day"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber = 1
                          - countType   = "sinceImagePushed"
                          - countUnit   = "days"
                          - tagStatus   = "untagged"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "531133914787" -> null
      - repository  = "ansible" -> null
    }

  # module.ansible.aws_ecr_repository.repository has been deleted
  - resource "aws_ecr_repository" "repository" {
      - arn                  = "arn:aws:ecr:us-east-1:531133914787:repository/ansible" -> null
      - id                   = "ansible" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "ansible" -> null
      - registry_id          = "531133914787" -> null
      - repository_url       = "531133914787.dkr.ecr.us-east-1.amazonaws.com/ansible" -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

  # module.ansible.aws_ecr_repository_policy.policy has been deleted
  - resource "aws_ecr_repository_policy" "policy" {
      - id          = "ansible" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:UploadLayerPart",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:DescribeRepositories",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:ListImages",
                          - "ecr:DeleteRepository",
                          - "ecr:BatchDeleteImage",
                          - "ecr:SetRepositoryPolicy",
                          - "ecr:DeleteRepositoryPolicy",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - registry_id = "531133914787" -> null
      - repository  = "ansible" -> null
    }

  # module.ansible.aws_ecs_cluster.cluster has been deleted
  - resource "aws_ecs_cluster" "cluster" {
      - arn                = "arn:aws:ecs:us-east-1:531133914787:cluster/ansible" -> null
      - capacity_providers = [] -> null
      - id                 = "arn:aws:ecs:us-east-1:531133914787:cluster/ansible" -> null
      - name               = "ansible" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
    }

  # module.ansible.aws_ecs_task_definition.task has been deleted
  - resource "aws_ecs_task_definition" "task" {
      - arn                      = "arn:aws:ecs:us-east-1:531133914787:task-definition/ansible:9" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "531133914787.dkr.ecr.us-east-1.amazonaws.com/ansible:latest"
                  - mountPoints      = []
                  - name             = "ansible"
                  - portMappings     = []
                  - volumesFrom      = []
                  - workingDirectory = "/var/ansible"
                },
            ]
        ) -> null
      - cpu                      = "256" -> null
      - execution_role_arn       = "arn:aws:iam::531133914787:role/ansible_ECSTaskRole" -> null
      - family                   = "ansible" -> null
      - id                       = "ansible" -> null
      - memory                   = "512" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 9 -> null
      - skip_destroy             = false -> null
      - tags_all                 = {} -> null

      - runtime_platform {
          - cpu_architecture        = "X86_64" -> null
          - operating_system_family = "LINUX" -> null
        }
    }

  # module.ansible.aws_iam_role.role has been deleted
  - resource "aws_iam_role" "role" {
      - arn                   = "arn:aws:iam::531133914787:role/ansible_ECSTaskRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = "ECSTaskExecution"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-03-22T04:36:00Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ansible_ECSTaskRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ansible_ECSTaskRole" -> null
      - path                  = "/" -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAXXKQML2RX75ANNVVX" -> null

      - inline_policy {}
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.endpoint_01.aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.endpoint_01.aws_api_gateway_integration.options will be created
  + resource "aws_api_gateway_integration" "options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = "WHEN_NO_MATCH"
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.endpoint_01.aws_api_gateway_integration_response.options will be created
  + resource "aws_api_gateway_integration_response" "options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.endpoint_01.aws_api_gateway_method.method will be created
  + resource "aws_api_gateway_method" "method" {
      + api_key_required     = true
      + authorization        = "NONE"
      + http_method          = "POST"
      + id                   = (known after apply)
      + request_models       = {
          + "application/json" = "RequestModel"
        }
      + request_parameters   = {
          + "method.request.header.content-type" = true
          + "method.request.header.x-api-key"    = true
          + "method.request.querystring.code"    = true
        }
      + request_validator_id = (known after apply)
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
    }

  # module.endpoint_01.aws_api_gateway_method.options will be created
  + resource "aws_api_gateway_method" "options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.endpoint_01.aws_api_gateway_method_response.options will be created
  + resource "aws_api_gateway_method_response" "options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.endpoint_01.aws_api_gateway_method_response.response_200 will be created
  + resource "aws_api_gateway_method_response" "response_200" {
      + http_method = "POST"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "200"
    }

  # module.endpoint_01.aws_api_gateway_model.model will be created
  + resource "aws_api_gateway_model" "model" {
      + content_type = "application/json"
      + description  = "Request schema model."
      + id           = (known after apply)
      + name         = "RequestModel"
      + rest_api_id  = (known after apply)
      + schema       = jsonencode(
            {
              + $schema              = "http://json-schema.org/draft-04/schema#"
              + additionalProperties = false
              + properties           = {
                  + myname = {
                      + type = "string"
                    }
                }
              + required             = [
                  + "myname",
                ]
              + title                = "UserModel"
              + type                 = "object"
            }
        )
    }

  # module.endpoint_01.aws_api_gateway_resource.resource will be created
  + resource "aws_api_gateway_resource" "resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "event"
      + rest_api_id = (known after apply)
    }

  # module.endpoint_01.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.endpoint_01.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + description                    = "Application security demo, deployed by Terraform."
      + filename                       = "./modules/security_demo_endpoint/resources/lambda_function.zip"
      + function_name                  = "tf_lambda"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "dclCGdtuSmLhltdxqzmQqGVMhlCT0rosLPp7WcdVfp0="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CORS"     = "*"
              + "ENCODING" = "latin-1"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.endpoint_01.aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "tf_lambda"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # module.security_demo.aws_api_gateway_api_key.api_key will be created
  + resource "aws_api_gateway_api_key" "api_key" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "my_api_key"
      + tags_all          = (known after apply)
      + value             = (sensitive value)
    }

  # module.security_demo.aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "test"
      + triggers      = {
          + "redeployment" = "879bef1b9da7509ea1861d6c6ddc6d6a536f3c5f"
        }
    }

  # module.security_demo.aws_api_gateway_integration.options will be created
  + resource "aws_api_gateway_integration" "options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = "WHEN_NO_MATCH"
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.security_demo.aws_api_gateway_integration_response.options will be created
  + resource "aws_api_gateway_integration_response" "options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.security_demo.aws_api_gateway_method.options will be created
  + resource "aws_api_gateway_method" "options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.security_demo.aws_api_gateway_method_response.options will be created
  + resource "aws_api_gateway_method_response" "options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.security_demo.aws_api_gateway_method_settings.all will be created
  + resource "aws_api_gateway_method_settings" "all" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "test"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "OFF"
          + metrics_enabled                            = false
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = 500
          + throttling_rate_limit                      = 1000
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.security_demo.aws_api_gateway_request_validator.validator will be created
  + resource "aws_api_gateway_request_validator" "validator" {
      + id                          = (known after apply)
      + name                        = "validator"
      + rest_api_id                 = (known after apply)
      + validate_request_body       = true
      + validate_request_parameters = true
    }

  # module.security_demo.aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Application security demo, deployed by Terraform."
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "tf_api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.security_demo.aws_api_gateway_usage_plan.usage_plan will be created
  + resource "aws_api_gateway_usage_plan" "usage_plan" {
      + arn         = (known after apply)
      + description = "API usage plan."
      + id          = (known after apply)
      + name        = "my_usage_plan"
      + tags_all    = (known after apply)

      + api_stages {
          + api_id = (known after apply)
          + stage  = "test"
        }

      + quota_settings {
          + limit  = 10000
          + offset = 0
          + period = "MONTH"
        }

      + throttle_settings {
          + burst_limit = 500
          + rate_limit  = 1000
        }
    }

  # module.security_demo.aws_api_gateway_usage_plan_key.plan_key will be created
  + resource "aws_api_gateway_usage_plan_key" "plan_key" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # module.security_demo.aws_wafv2_web_acl.waf_regional will be created
  + resource "aws_wafv2_web_acl" "waf_regional" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "Standard WebACL for API Gateway, TerraForm deploy."
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "StandardACL_Regional"
      + scope       = "REGIONAL"
      + tags_all    = (known after apply)

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "AWSManagedRulesAmazonIpReputation"
          + priority = 2

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesAmazonIpReputation"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRule"
          + priority = 0

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"

                  + excluded_rule {
                      + name = "GenericRFI_QUERYARGUMENTS"
                    }
                  + excluded_rule {
                      + name = "GenericRFI_BODY"
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesCommonRule"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRule"
          + priority = 1

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesKnownBadInputsRule"
              + sampled_requests_enabled   = false
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = false
          + metric_name                = "StandardACL"
          + sampled_requests_enabled   = false
        }
    }

  # module.security_demo.aws_wafv2_web_acl_association.waf_association will be created
  + resource "aws_wafv2_web_acl_association" "waf_association" {
      + id           = (known after apply)
      + resource_arn = (known after apply)
      + web_acl_arn  = (known after apply)
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint_01_url = (known after apply)

```

</details>

*Pusher: @fer1035, Action: `pull_request`*